app/controllers/tweets_controller.rb

SELECT * FROM `tweets`
---
  def index
    @pages = Tweet.pages
    page = params[:page].to_i
    puts "-------------------------------------------#{params[:page]}"
    page = 1 if params[:page].nil? || !params[:page].scan(/[^0-9]/).empty?
    @current_page = page
    @tweets = Tweet.find_with_pagenation page